# AreaTagType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaTag..::..AreaTagType Property
AreaTag Class See Also
---
The tag type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AreaTagType AreaTagType { get; set; }
```

Visual Basic
---
```text
Public Property AreaTagType As AreaTagType
	Get
	Set
```

Visual C++
---
```text
public:
property AreaTagType^ AreaTagType {
	AreaTagType^ get ();
	void set (AreaTagType^ value);
}
```

# See Also
AreaTag Class
Autodesk.Revit.DB Namespace